In [35]:
import numpy as np  #importing library package
import pandas as pd #importing library

In [77]:
df = pd.DataFrame(pd.read_csv('train.csv')) #reading data from csv file
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [78]:
df.shape #shows 891 rows and 12 columns

(891, 12)

In [79]:
df.isnull().sum() #finding columns having null values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [80]:
drop_col = df.isnull().sum()[df.isnull().sum()>(35/100 * df.shape[0])]
drop_col

Cabin    687
dtype: int64

In [81]:
drop_col.index #index of the column having null values greater than 35%

Index(['Cabin'], dtype='object')

In [82]:
df.drop(drop_col.index , axis=1 , inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [83]:
df.fillna(df.mean(), inplace= True) #filling the null values with the mean of the remaining values (strings= based on frequency of top value, and int/float = based on mean)*, Since 'embarked' is string datatype, it is not done in this code, i.e. mean() function is only used for integers floats and such
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [84]:
df['Embarked'].describe() #this is to determine the frequency and the value of top appearing object for string

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [85]:
df['Embarked'].fillna('S', inplace= True) #filling the null values of strings with S (top occuring object)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [47]:
df.corr() #correlation function

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

In [86]:
df['Family Size']=df['SibSp']+df['Parch'] #for code to be precise and short combining the columns 
df.drop(['SibSp', 'Parch'], axis=1, inplace=True) #dropping previous two columns
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  Family Size
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658    -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307     0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500     0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566    -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000     0.217138
Family Size    -0.040143  0.016639  0.065997 -0.248512  0.217138     1.000000

In [87]:
df['Alone'] = [ 0 if df['Family Size'][i]>0 else 1 for i in df.index]  #determining how many poeple were alone and how many had family with them
df.head()

   PassengerId  Survived  Pclass  ... Embarked Family Size  Alone
0            1         0       3  ...        S           1      0
1            2         1       1  ...        C           1      0
2            3         1       3  ...        S           0      1
3            4         1       1  ...        S           1      0
4            5         0       3  ...        S           0      1

[5 rows x 11 columns]

In [88]:
df.groupby(['Alone'])['Survived'].mean() #finding mean of people survived being alone vs people surviving with their family

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [89]:
df[['Alone','Fare']].corr() #finding correlation btw fare and being alone determining survival

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [90]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index] #1 for female, 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [91]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64